Autodesk.Revit.DB.AdaptivePointType
An enumerated type containing possible types for Adaptive Points.
Since:
2012

Autodesk.Revit.DB.AdaptivePointType.ShapeHandlePoint
Shape Handle Point.

Autodesk.Revit.DB.AdaptivePointType.PlacementPoint
Placement Point.

Autodesk.Revit.DB.AdaptivePointType.ReferencePoint
Reference Point.